#+TITLE: Factory Pattern
#+AUTHOR: Guowei Lv
#+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER_EXTRA:

* How to run
Press =C-c C-c= on the code block below.

#+BEGIN_SRC elisp :exports none
;; tangle the source code
(org-babel-tangle)
;; export to pdf
(org-latex-export-to-pdf)
;; build
(shell-command-to-string "/opt/gradle-2.3/bin/gradle jar")
#+END_SRC

#+RESULTS:
#+begin_example
:compileJavaNote: Some input files use unchecked or unsafe operations.
Note: Recompile with -Xlint:unchecked for details.

:processResources UP-TO-DATE
:classes
:jar

BUILD SUCCESSFUL

Total time: 3.915 secs
#+end_example
